read_verilog ./source/upcounter.v

proc; opt; memory; opt; fsm; opt; techmap; opt

dfflibmap -liberty "/usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib"

abc -liberty "/usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib"

opt

write_verilog ./synthesis/synth.v
